# SupplyChain Analysist For Fact and Dim Tables

In [1]:
import pandas as pd

# Read File

In [2]:
df = pd.read_csv('data/DataCoSupplyChainDataset.csv', encoding='latin1')

# Overview Of The Dataset

In [3]:
df.shape

(180519, 53)

In [4]:
df.columns

Index(['Type', 'Days for shipping (real)', 'Days for shipment (scheduled)',
       'Benefit per order', 'Sales per customer', 'Delivery Status',
       'Late_delivery_risk', 'Category Id', 'Category Name', 'Customer City',
       'Customer Country', 'Customer Email', 'Customer Fname', 'Customer Id',
       'Customer Lname', 'Customer Password', 'Customer Segment',
       'Customer State', 'Customer Street', 'Customer Zipcode',
       'Department Id', 'Department Name', 'Latitude', 'Longitude', 'Market',
       'Order City', 'Order Country', 'Order Customer Id',
       'order date (DateOrders)', 'Order Id', 'Order Item Cardprod Id',
       'Order Item Discount', 'Order Item Discount Rate', 'Order Item Id',
       'Order Item Product Price', 'Order Item Profit Ratio',
       'Order Item Quantity', 'Sales', 'Order Item Total',
       'Order Profit Per Order', 'Order Region', 'Order State', 'Order Status',
       'Order Zipcode', 'Product Card Id', 'Product Category Id',
       'Product Description', 'Product Image', 'Product Name', 'Product Price',
       'Product Status', 'shipping date (DateOrders)', 'Shipping Mode'],
      dtype='object')

In [5]:
df.head()

,Type,Days for shipping (real),Days for shipment (scheduled),Benefit per order,Sales per customer,Delivery Status,Late_delivery_risk,Category Id,Category Name,Customer City,...,Order Zipcode,Product Card Id,Product Category Id,Product Description,Product Image,Product Name,Product Price,Product Status,shipping date (DateOrders),Shipping Mode
0,DEBIT,3,4,91.250000,314.640015,Advance shipping,0,73,Sporting Goods,Caguas,...,NaN,1360,73,NaN,http://images.acmesports.sports/Smart+watch,Smart watch,327.75,0,2/3/2018 22:56,Standard Class
1,TRANSFER,5,4,-249.089996,311.359985,Late delivery,1,73,Sporting Goods,Caguas,...,NaN,1360,73,NaN,http://images.acmesports.sports/Smart+watch,Smart watch,327.75,0,1/18/2018 12:27,Standard Class
2,CASH,4,4,-247.779999,309.720001,Shipping on time,0,73,Sporting Goods,San Jose,...,NaN,1360,73,NaN,http://images.acmesports.sports/Smart+watch,Smart watch,327.75,0,1/17/2018 12:06,Standard Class
3,DEBIT,3,4,22.860001,304.809998,Advance shipping,0,73,Sporting Goods,Los Angeles,...,NaN,1360,73,NaN,http://images.acmesports.sports/Smart+watch,Smart watch,327.75,0,1/16/2018 11:45,Standard Class
4,PAYMENT,2,4,134.210007,298.250000,Advance shipping,0,73,Sporting Goods,Caguas,...,NaN,1360,73,NaN,http://images.acmesports.sports/Smart+watch,Smart watch,327.75,0,1/15/2018 11:24,Standard Class

In [6]:
df[['Department Id', 'Department Name']]

        Department Id Department Name
0                   2         Fitness
1                   2         Fitness
2                   2         Fitness
3                   2         Fitness
4                   2         Fitness
...               ...             ...
180514              7        Fan Shop
180515              7        Fan Shop
180516              7        Fan Shop
180517              7        Fan Shop
180518              7        Fan Shop

[180519 rows x 2 columns]

In [7]:
df[['Category Id', 'Category Name']]

        Category Id   Category Name
0                73  Sporting Goods
1                73  Sporting Goods
2                73  Sporting Goods
3                73  Sporting Goods
4                73  Sporting Goods
...             ...             ...
180514           45         Fishing
180515           45         Fishing
180516           45         Fishing
180517           45         Fishing
180518           45         Fishing

[180519 rows x 2 columns]

# Tb Fact Sales

In [8]:
tb_fact_sales = df[['Order Id', 'Order Item Id', 'Sales']]

In [9]:
tb_fact_sales.shape

(180519, 3)

In [10]:
tb_fact_sales.head()

   Order Id  Order Item Id   Sales
0     77202         180517  327.75
1     75939         179254  327.75
2     75938         179253  327.75
3     75937         179252  327.75
4     75936         179251  327.75

In [11]:
tb_fact_sales['Order Id'].value_counts(ascending=False)

Order Id
48880    5
3605     5
28265    5
50037    5
27861    5
        ..
42011    1
42068    1
42072    1
42118    1
26118    1
Name: count, Length: 65752, dtype: int64

In [12]:
tb_fact_sales['Order Id'].value_counts(ascending=False)

Order Id
48880    5
3605     5
28265    5
50037    5
27861    5
        ..
42011    1
42068    1
42072    1
42118    1
26118    1
Name: count, Length: 65752, dtype: int64

In [13]:
tb_fact_sales[tb_fact_sales['Order Id'] == 48880]

        Order Id  Order Item Id       Sales
118698     48880         122220  129.990005
119105     48880         122221  199.979996
119676     48880         122222  159.960007
119677     48880         122218  159.960007
119995     48880         122219  250.000000

# Order

In [94]:
tb_dim_order = df[['Order Id', 'Type' ,'order date (DateOrders)', 'Order Status', 'Market', 'Order Region', 'Order Country', 'Order State', 'Order City', 'Days for shipping (real)', 'Days for shipment (scheduled)','Delivery Status','Late_delivery_risk', 'shipping date (DateOrders)', 'Shipping Mode','Customer Id']]

In [95]:
tb_dim_order.shape

(180519, 16)

In [96]:
tb_dim_order.head()

,Order Id,Type,order date (DateOrders),Order Status,Market,Order Region,Order Country,Order State,Order City,Days for shipping (real),Days for shipment (scheduled),Delivery Status,Late_delivery_risk,shipping date (DateOrders),Shipping Mode,Customer Id
0,77202,DEBIT,1/31/2018 22:56,COMPLETE,Pacific Asia,Southeast Asia,Indonesia,Java Occidental,Bekasi,3,4,Advance shipping,0,2/3/2018 22:56,Standard Class,20755
1,75939,TRANSFER,1/13/2018 12:27,PENDING,Pacific Asia,South Asia,India,Rajastán,Bikaner,5,4,Late delivery,1,1/18/2018 12:27,Standard Class,19492
2,75938,CASH,1/13/2018 12:06,CLOSED,Pacific Asia,South Asia,India,Rajastán,Bikaner,4,4,Shipping on time,0,1/17/2018 12:06,Standard Class,19491
3,75937,DEBIT,1/13/2018 11:45,COMPLETE,Pacific Asia,Oceania,Australia,Queensland,Townsville,3,4,Advance shipping,0,1/16/2018 11:45,Standard Class,19490
4,75936,PAYMENT,1/13/2018 11:24,PENDING_PAYMENT,Pacific Asia,Oceania,Australia,Queensland,Townsville,2,4,Advance shipping,0,1/15/2018 11:24,Standard Class,19489

In [97]:
tb_dim_order['Order Id'].value_counts(ascending=False)

Order Id
48880    5
3605     5
28265    5
50037    5
27861    5
        ..
42011    1
42068    1
42072    1
42118    1
26118    1
Name: count, Length: 65752, dtype: int64

In [98]:
tb_dim_order[tb_dim_order['Order Id'] == 48880]

,Order Id,Type,order date (DateOrders),Order Status,Market,Order Region,Order Country,Order State,Order City,Days for shipping (real),Days for shipment (scheduled),Delivery Status,Late_delivery_risk,shipping date (DateOrders),Shipping Mode,Customer Id
118698,48880,TRANSFER,12/14/2016 12:29,PROCESSING,Pacific Asia,West Asia,Arabia Saudí,Ash Sharqiyah,Al Mubarraz,6,2,Late delivery,1,12/20/2016 12:29,Second Class,3714
119105,48880,TRANSFER,12/14/2016 12:29,PROCESSING,Pacific Asia,West Asia,Arabia Saudí,Ash Sharqiyah,Al Mubarraz,6,2,Late delivery,1,12/20/2016 12:29,Second Class,3714
119676,48880,TRANSFER,12/14/2016 12:29,PROCESSING,Pacific Asia,West Asia,Arabia Saudí,Ash Sharqiyah,Al Mubarraz,6,2,Late delivery,1,12/20/2016 12:29,Second Class,3714
119677,48880,TRANSFER,12/14/2016 12:29,PROCESSING,Pacific Asia,West Asia,Arabia Saudí,Ash Sharqiyah,Al Mubarraz,6,2,Late delivery,1,12/20/2016 12:29,Second Class,3714
119995,48880,TRANSFER,12/14/2016 12:29,PROCESSING,Pacific Asia,West Asia,Arabia Saudí,Ash Sharqiyah,Al Mubarraz,6,2,Late delivery,1,12/20/2016 12:29,Second Class,3714

In [99]:
tb_dim_order[tb_dim_order['Order Id'] == 3605]

,Order Id,Type,order date (DateOrders),Order Status,Market,Order Region,Order Country,Order State,Order City,Days for shipping (real),Days for shipment (scheduled),Delivery Status,Late_delivery_risk,shipping date (DateOrders),Shipping Mode,Customer Id
62362,3605,TRANSFER,2/22/2015 14:38,PROCESSING,LATAM,Central America,Nicaragua,Managua,Managua,6,4,Late delivery,1,2/28/2015 14:38,Standard Class,6083
62369,3605,TRANSFER,2/22/2015 14:38,PROCESSING,LATAM,Central America,Nicaragua,Managua,Managua,6,4,Late delivery,1,2/28/2015 14:38,Standard Class,6083
85845,3605,TRANSFER,2/22/2015 14:38,PROCESSING,LATAM,Central America,Nicaragua,Managua,Managua,6,4,Late delivery,1,2/28/2015 14:38,Standard Class,6083
87115,3605,TRANSFER,2/22/2015 14:38,PROCESSING,LATAM,Central America,Nicaragua,Managua,Managua,6,4,Late delivery,1,2/28/2015 14:38,Standard Class,6083
87117,3605,TRANSFER,2/22/2015 14:38,PROCESSING,LATAM,Central America,Nicaragua,Managua,Managua,6,4,Late delivery,1,2/28/2015 14:38,Standard Class,6083

In [100]:
tb_dim_order.columns

Index(['Order Id', 'Type', 'order date (DateOrders)', 'Order Status', 'Market',
       'Order Region', 'Order Country', 'Order State', 'Order City',
       'Days for shipping (real)', 'Days for shipment (scheduled)',
       'Delivery Status', 'Late_delivery_risk', 'shipping date (DateOrders)',
       'Shipping Mode', 'Customer Id'],
      dtype='object')

In [101]:
tb_dim_order_grouped = tb_dim_order.groupby(by=['Order Id'])['Customer Id'].nunique().to_frame()

In [102]:
tb_dim_order_grouped.sort_values(by='Customer Id',ascending=False)

          Customer Id
Order Id
1                   1
52691               1
52578               1
52579               1
52580               1
...               ...
26243               1
26244               1
26245               1
26246               1
77204               1

[65752 rows x 1 columns]

In [103]:
tb_dim_order_grouped.columns

Index(['Customer Id'], dtype='object')

In [104]:
tb_dim_order_grouped[tb_dim_order_grouped.index == 48880]

          Customer Id
Order Id
48880               1

In [25]:
tb_dim_order_grouped = tb_dim_order.groupby(by=['Order Id'])['Order Status'].nunique().to_frame()

In [26]:
tb_dim_order_grouped.sort_values(by='Order Status',ascending=False)

          Order Status
Order Id
1                    1
52691                1
52578                1
52579                1
52580                1
...                ...
26243                1
26244                1
26245                1
26246                1
77204                1

[65752 rows x 1 columns]

In [27]:
tb_dim_order.drop_duplicates(subset=['Order Id'], inplace=True)

/tmp/ipykernel_2589/1169094549.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  tb_dim_order.drop_duplicates(subset=['Order Id'], inplace=True)

In [28]:
tb_dim_order.shape

(65752, 9)

In [29]:
tb_dim_order.head()

,Order Id,order date (DateOrders),Order Status,Market,Order Region,Order Country,Order State,Order City,Customer Id
0,77202,1/31/2018 22:56,COMPLETE,Pacific Asia,Southeast Asia,Indonesia,Java Occidental,Bekasi,20755
1,75939,1/13/2018 12:27,PENDING,Pacific Asia,South Asia,India,Rajastán,Bikaner,19492
2,75938,1/13/2018 12:06,CLOSED,Pacific Asia,South Asia,India,Rajastán,Bikaner,19491
3,75937,1/13/2018 11:45,COMPLETE,Pacific Asia,Oceania,Australia,Queensland,Townsville,19490
4,75936,1/13/2018 11:24,PENDING_PAYMENT,Pacific Asia,Oceania,Australia,Queensland,Townsville,19489

# Order Itemm

In [30]:
tb_dim_order_item = df[['Order Item Id', 'Order Item Discount Rate', 'Order Item Profit Ratio', 'Product Card Id']]

In [31]:
tb_dim_order_item.shape

(180519, 4)

In [32]:
tb_dim_order_item.head()

,Order Item Id,Order Item Discount Rate,Order Item Profit Ratio,Product Card Id
0,180517,0.04,0.29,1360
1,179254,0.05,-0.80,1360
2,179253,0.06,-0.80,1360
3,179252,0.07,0.08,1360
4,179251,0.09,0.45,1360

In [33]:
tb_dim_order_item['Order Item Id'].value_counts(ascending=False)

Order Item Id
180517    1
42681     1
28953     1
39851     1
173601    1
         ..
14991     1
150102    1
138584    1
150270    1
65113     1
Name: count, Length: 180519, dtype: int64

## Products

In [34]:
tb_dim_product = df[['Product Card Id', 'Product Name', 'Product Price', 'Product Status', 'Product Image', 'Category Id']]

In [35]:
tb_dim_product.shape

(180519, 6)

In [36]:
tb_dim_product['Product Card Id'].value_counts(ascending=False)

Product Card Id
365     24515
403     22246
502     21035
1014    19298
1004    17325
        ...
127        27
208        15
860        11
226        10
60         10
Name: count, Length: 118, dtype: int64

In [37]:
tb_dim_product[tb_dim_product['Product Card Id'] == 365]

,Product Card Id,Product Name,Product Price,Product Status,Product Image,Category Id
48,365,Perfect Fitness Perfect Rip Deck,59.990002,0,http://images.acmesports.sports/Perfect+Fitnes...,17
57,365,Perfect Fitness Perfect Rip Deck,59.990002,0,http://images.acmesports.sports/Perfect+Fitnes...,17
58,365,Perfect Fitness Perfect Rip Deck,59.990002,0,http://images.acmesports.sports/Perfect+Fitnes...,17
66,365,Perfect Fitness Perfect Rip Deck,59.990002,0,http://images.acmesports.sports/Perfect+Fitnes...,17
67,365,Perfect Fitness Perfect Rip Deck,59.990002,0,http://images.acmesports.sports/Perfect+Fitnes...,17
...,...,...,...,...,...,...
179624,365,Perfect Fitness Perfect Rip Deck,59.990002,0,http://images.acmesports.sports/Perfect+Fitnes...,17
179625,365,Perfect Fitness Perfect Rip Deck,59.990002,0,http://images.acmesports.sports/Perfect+Fitnes...,17
179626,365,Perfect Fitness Perfect Rip Deck,59.990002,0,http://images.acmesports.sports/Perfect+Fitnes...,17
179627,365,Perfect Fitness Perfect Rip Deck,59.990002,0,http://images.acmesports.sports/Perfect+Fitnes...,17
179628,365,Perfect Fitness Perfect Rip Deck,59.990002,0,http://images.acmesports.sports/Perfect+Fitnes...,17

In [38]:
tb_dim_product_grouped = tb_dim_product.groupby(by=['Product Card Id', 'Product Name', 'Product Price', 'Product Status', 'Product Image', 'Category Id']).agg('count').reset_index()

In [39]:
tb_dim_product_grouped.shape

(118, 6)

In [40]:
tb_dim_product_grouped.head()

,Product Card Id,Product Name,Product Price,Product Status,Product Image,Category Id
0,19,Nike Men's Fingertrap Max Training Shoe,124.989998,0,http://images.acmesports.sports/Nike+Men%27s+F...,2
1,24,Elevation Training Mask 2.0,79.989998,0,http://images.acmesports.sports/Elevation+Trai...,2
2,35,adidas Brazuca 2014 Official Match Ball,159.990005,0,http://images.acmesports.sports/adidas+Brazuca...,3
3,37,adidas Kids' F5 Messi FG Soccer Cleat,34.990002,0,http://images.acmesports.sports/adidas+Kids%27...,3
4,44,adidas Men's F10 Messi TRX FG Soccer Cleat,59.990002,0,http://images.acmesports.sports/adidas+Men%27s...,3

In [41]:
tb_dim_product_grouped.columns

Index(['Product Card Id', 'Product Name', 'Product Price', 'Product Status',
       'Product Image', 'Category Id'],
      dtype='object')

In [42]:
tb_dim_product_grouped[tb_dim_product_grouped['Product Card Id'] == 365]

,Product Card Id,Product Name,Product Price,Product Status,Product Image,Category Id
35,365,Perfect Fitness Perfect Rip Deck,59.990002,0,http://images.acmesports.sports/Perfect+Fitnes...,17

# Category

In [59]:
tb_dim_category = df[['Category Id', 'Category Name', 'Department Id']]

In [60]:
tb_dim_category.shape

(180519, 3)

In [61]:
tb_dim_category.head()

   Category Id   Category Name  Department Id
0           73  Sporting Goods              2
1           73  Sporting Goods              2
2           73  Sporting Goods              2
3           73  Sporting Goods              2
4           73  Sporting Goods              2

In [62]:
tb_dim_category['Category Id'].value_counts(ascending=False)

Category Id
17    24551
18    22246
24    21035
46    19298
45    17325
48    15540
43    13729
9     12487
29    10984
37     2029
40     1780
36     1475
26     1201
13     1127
35     1070
41      974
75      838
63      652
76      650
3       632
7       614
62      592
74      529
33      524
72      492
66      484
68      484
67      483
64      442
32      441
44      440
71      434
65      431
12      423
59      405
38      384
69      362
73      357
5       343
6       328
11      309
30      283
61      271
70      208
60      207
31      181
2       138
10      111
16       68
4        67
34       61
Name: count, dtype: int64

In [63]:
tb_dim_category[tb_dim_category['Category Id'] == 17]

        Category Id Category Name  Department Id
48               17        Cleats              4
57               17        Cleats              4
58               17        Cleats              4
66               17        Cleats              4
67               17        Cleats              4
...             ...           ...            ...
179624           17        Cleats              4
179625           17        Cleats              4
179626           17        Cleats              4
179627           17        Cleats              4
179628           17        Cleats              4

[24551 rows x 3 columns]

In [64]:
tb_dim_category_grouped = tb_dim_category.groupby(by=['Category Id', 'Category Name', 'Department Id']).agg('count').reset_index()

In [66]:
tb_dim_category_grouped.shape

(51, 3)

In [46]:
tb_dim_category.drop_duplicates(subset=['Category Id'], inplace=True)

/tmp/ipykernel_2589/972202479.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  tb_dim_category.drop_duplicates(subset=['Category Id'], inplace=True)

In [47]:
tb_dim_category.shape

(51, 2)

# Customer

In [48]:
tb_dim_customer = df[['Customer Id', 'Customer Lname', 'Customer Fname', 'Customer Country', 'Customer State', 'Customer Zipcode', 'Customer City', 'Customer Street']]

In [49]:
tb_dim_customer.head()

,Customer Id,Customer Lname,Customer Fname,Customer Country,Customer State,Customer Zipcode,Customer City,Customer Street
0,20755,Holloway,Cally,Puerto Rico,PR,725.0,Caguas,5365 Noble Nectar Island
1,19492,Luna,Irene,Puerto Rico,PR,725.0,Caguas,2679 Rustic Loop
2,19491,Maldonado,Gillian,EE. UU.,CA,95125.0,San Jose,8510 Round Bear Gate
3,19490,Tate,Tana,EE. UU.,CA,90027.0,Los Angeles,3200 Amber Bend
4,19489,Hendricks,Orli,Puerto Rico,PR,725.0,Caguas,8671 Iron Anchor Corners

In [50]:
tb_dim_customer.shape

(180519, 8)

In [51]:
tb_dim_customer['Customer Id'].value_counts(ascending=False)

Customer Id
5654     47
10591    45
5004     45
5715     44
3708     44
         ..
18698     1
15537     1
15484     1
20681     1
2677      1
Name: count, Length: 20652, dtype: int64

In [52]:
tb_dim_customer[tb_dim_customer['Customer Id'] == 47]

,Customer Id,Customer Lname,Customer Fname,Customer Country,Customer State,Customer Zipcode,Customer City,Customer Street
474,47,Fuller,Lori,Puerto Rico,PR,725.0,Caguas,357 Noble Lane
1318,47,Fuller,Lori,Puerto Rico,PR,725.0,Caguas,357 Noble Lane
179270,47,Fuller,Lori,Puerto Rico,PR,725.0,Caguas,357 Noble Lane

In [53]:
tb_dim_customer.columns

Index(['Customer Id', 'Customer Lname', 'Customer Fname', 'Customer Country',
       'Customer State', 'Customer Zipcode', 'Customer City',
       'Customer Street'],
      dtype='object')

In [54]:
tb_dim_customer_grouped = tb_dim_customer.groupby(by=['Customer Id', 'Customer Lname', 'Customer Fname', 'Customer Country',
       'Customer State', 'Customer Zipcode', 'Customer City',
       'Customer Street']).agg('count').reset_index()

In [55]:
tb_dim_customer_grouped.head()

,Customer Id,Customer Lname,Customer Fname,Customer Country,Customer State,Customer Zipcode,Customer City,Customer Street
0,1,Hernandez,Richard,EE. UU.,TX,78521.0,Brownsville,6303 Heather Plaza
1,2,Barrett,Mary,EE. UU.,CO,80126.0,Littleton,9526 Noble Embers Ridge
2,3,Smith,Ann,Puerto Rico,PR,725.0,Caguas,3422 Blue Pioneer Bend
3,4,Jones,Mary,EE. UU.,CA,92069.0,San Marcos,8324 Little Common
4,5,Hudson,Robert,Puerto Rico,PR,725.0,Caguas,10 Crystal River Mall

In [56]:
tb_dim_customer_grouped['Customer Id'].value_counts(ascending=False)

Customer Id
1        1
13893    1
13871    1
13870    1
13869    1
        ..
6937     1
6936     1
6935     1
6934     1
20757    1
Name: count, Length: 20641, dtype: int64

In [57]:
tb_dim_customer_grouped[tb_dim_customer_grouped['Customer Id'] == 1946]

,Customer Id,Customer Lname,Customer Fname,Customer Country,Customer State,Customer Zipcode,Customer City,Customer Street
1922,1946,Smith,Diane,Puerto Rico,PR,725.0,Caguas,3838 Sleepy Mountain Centre

In [58]:
tb_dim_customer_grouped.shape

(20641, 8)

# Department

In [68]:
tb_dim_department = df[['Department Id', 'Department Name']]

In [69]:
tb_dim_department.shape

(180519, 2)

In [70]:
tb_dim_department['Department Id'].value_counts(ascending=False)

Department Id
7     66861
4     48998
5     33220
3     14525
6      9686
2      2479
9      2026
10     1465
11      492
8       405
12      362
Name: count, dtype: int64

In [71]:
tb_dim_department[tb_dim_department['Department Id'] == 7]

        Department Id Department Name
118                 7        Fan Shop
143                 7        Fan Shop
144                 7        Fan Shop
293                 7        Fan Shop
1343                7        Fan Shop
...               ...             ...
180514              7        Fan Shop
180515              7        Fan Shop
180516              7        Fan Shop
180517              7        Fan Shop
180518              7        Fan Shop

[66861 rows x 2 columns]

# Shipment

In [72]:
df.columns

Index(['Type', 'Days for shipping (real)', 'Days for shipment (scheduled)',
       'Benefit per order', 'Sales per customer', 'Delivery Status',
       'Late_delivery_risk', 'Category Id', 'Category Name', 'Customer City',
       'Customer Country', 'Customer Email', 'Customer Fname', 'Customer Id',
       'Customer Lname', 'Customer Password', 'Customer Segment',
       'Customer State', 'Customer Street', 'Customer Zipcode',
       'Department Id', 'Department Name', 'Latitude', 'Longitude', 'Market',
       'Order City', 'Order Country', 'Order Customer Id',
       'order date (DateOrders)', 'Order Id', 'Order Item Cardprod Id',
       'Order Item Discount', 'Order Item Discount Rate', 'Order Item Id',
       'Order Item Product Price', 'Order Item Profit Ratio',
       'Order Item Quantity', 'Sales', 'Order Item Total',
       'Order Profit Per Order', 'Order Region', 'Order State', 'Order Status',
       'Order Zipcode', 'Product Card Id', 'Product Category Id',
       'Product Description', 'Product Image', 'Product Name', 'Product Price',
       'Product Status', 'shipping date (DateOrders)', 'Shipping Mode'],
      dtype='object')

In [86]:
tb_dim_shipment = df[['Order Id', 'Days for shipping (real)', 'Days for shipment (scheduled)','Delivery Status',\
                      'Late_delivery_risk', 'shipping date (DateOrders)', 'Shipping Mode']]

In [78]:
tb_dim_shipment.head()

,Order Id,Days for shipping (real),Days for shipping (real),Days for shipment (scheduled),Delivery Status,Late_delivery_risk,shipping date (DateOrders),Shipping Mode
0,77202,3,3,4,Advance shipping,0,2/3/2018 22:56,Standard Class
1,75939,5,5,4,Late delivery,1,1/18/2018 12:27,Standard Class
2,75938,4,4,4,Shipping on time,0,1/17/2018 12:06,Standard Class
3,75937,3,3,4,Advance shipping,0,1/16/2018 11:45,Standard Class
4,75936,2,2,4,Advance shipping,0,1/15/2018 11:24,Standard Class

In [87]:
tb_dim_shipment['Order Id'].value_counts(ascending=False)

Order Id
48880    5
3605     5
28265    5
50037    5
27861    5
        ..
42011    1
42068    1
42072    1
42118    1
26118    1
Name: count, Length: 65752, dtype: int64

In [88]:
tb_dim_shipment[tb_dim_shipment['Order Id'] == 48880]

,Order Id,Days for shipping (real),Days for shipment (scheduled),Delivery Status,Late_delivery_risk,shipping date (DateOrders),Shipping Mode
118698,48880,6,2,Late delivery,1,12/20/2016 12:29,Second Class
119105,48880,6,2,Late delivery,1,12/20/2016 12:29,Second Class
119676,48880,6,2,Late delivery,1,12/20/2016 12:29,Second Class
119677,48880,6,2,Late delivery,1,12/20/2016 12:29,Second Class
119995,48880,6,2,Late delivery,1,12/20/2016 12:29,Second Class

In [90]:
tb_dim_shipment_grouped = tb_dim_shipment.groupby(
    by=['Order Id', 'Days for shipping (real)', 'Days for shipment (scheduled)','Delivery Status','Late_delivery_risk', 'shipping date (DateOrders)', 'Shipping Mode']
).agg('count').reset_index()

In [91]:
tb_dim_shipment_grouped.shape

(65752, 7)

In [93]:
tb_dim_shipment_grouped['Order Id'].value_counts(ascending=False)

Order Id
1        1
52691    1
52578    1
52579    1
52580    1
        ..
26243    1
26244    1
26245    1
26246    1
77204    1
Name: count, Length: 65752, dtype: int64

In [92]:
tb_dim_shipment_grouped[tb_dim_shipment_grouped['Order Id'] == 48880]

,Order Id,Days for shipping (real),Days for shipment (scheduled),Delivery Status,Late_delivery_risk,shipping date (DateOrders),Shipping Mode
40766,48880,6,2,Late delivery,1,12/20/2016 12:29,Second Class